load "#{PROJECT_ROOT}/tasks/project_command.rake"
#==============================================================================
# ■ Project 模块
#------------------------------------------------------------------------------
# 　本Rake项目默认模块, 算作命名空间
#==============================================================================
module Project
  #============================================================================
  # ■ Project Self
  #============================================================================
  class << self
    #--------------------------------------------------------------------------
    # ● 获取目标
    #--------------------------------------------------------------------------
    def targets
      @targets ||= {}
    end
    #--------------------------------------------------------------------------
    # ● 设置目标
    #--------------------------------------------------------------------------
    def target(key, &block)
      @targets[key].instance_eval(&block) if(@targets[key])
    end
    #--------------------------------------------------------------------------
    # ● 遍历目标
    #--------------------------------------------------------------------------
    def each_target(&block)
      @targets.each do |key, target|
        target.instance_eval(&block)
      end
    end
	end
  #============================================================================
  # ■ 工具链
  #============================================================================
  class Toolchain
    #==========================================================================
    # ■ Toolchain Self 获取当前
    #==========================================================================
    class << self
      attr_accessor :toolchains
    end
    #--------------------------------------------------------------------------
    # ● 初始化
    #--------------------------------------------------------------------------
    def initialize(name, &block)
      @name, @initializer = name.to_s, block
      Project::Toolchain.toolchains ||= {}
      Project::Toolchain.toolchains[@name] = self
    end
    #--------------------------------------------------------------------------
    # ● 设置
    #--------------------------------------------------------------------------
    def setup(conf)
      conf.instance_eval(&@initializer)
    end
    #--------------------------------------------------------------------------
    # ● 载入
    #--------------------------------------------------------------------------
    def self.load
      Dir.glob("#{PROJECT_ROOT}/tasks/toolchains/*.rake").each do |file|
        Kernel.load file
      end
    end
  end
  # 载入工具链
  Toolchain.load
  #============================================================================
  # ■ 构建类
  #============================================================================
  class Build
    #==========================================================================
    # ■ Build Self 获取当前
    #==========================================================================
    class << self
      attr_accessor :current
    end
    #--------------------------------------------------------------------------
    # ● 定义实例变量
    #--------------------------------------------------------------------------
    include             Rake::DSL
    attr_accessor       :name, :build_dir, :outname, :object_extx
    attr_reader         :toolchains
    #--------------------------------------------------------------------------
    # ● 设置命令
    #--------------------------------------------------------------------------
    COMMANDS = %w(cxx cc rc linker archiver)
    attr_block Project::Build::COMMANDS
    #--------------------------------------------------------------------------
    # ● 初始化
    #--------------------------------------------------------------------------
    def initialize(name, build_dir=nil, &block)
      @outname = @name = name
      @object_extx = ".o"
      # 不存在情况下构造
      unless Project.targets[@name]
        @build_dir = build_dir || ENV['BUILD_DIR'] || "#{PROJECT_ROOT}/build"
        @cxx = Compiler.new(self, %w(.cc .cxx .cpp))
        @cc = Compiler.new(self, %w(.c))
        @linker = Linker.new(self)
        @rc = ResourceCompiler.new(self, %w(.rc))
        @archiver = Archiver.new(self)
        @toolchains = []
        Project.targets[@name] = self
      end
      # 使用已经存在的项目
      Project::Build.current = Project.targets[@name]
      Project.targets[@name].instance_eval(&block)
    end
    #--------------------------------------------------------------------------
    # ● 设置工具链
    #--------------------------------------------------------------------------
    def toolchain(name)
      tc = Toolchain.toolchains[name.to_s]
      fail "Unknown #{name} toolchain" unless tc
      tc.setup(self)
      @toolchains.unshift name.to_s
    end
    #--------------------------------------------------------------------------
    # ● 生成文件名
    #--------------------------------------------------------------------------
    def filename(name)
      if name.is_a?(Array)
        name.flatten.map { |n| filename(n) }
      else
        '"%s"' % name
      end
    end
    #--------------------------------------------------------------------------
    # ● obj 文件名称
    #--------------------------------------------------------------------------
    def objfile(name)
      if name.is_a?(Array)
        name.flatten.map { |n| objfile(n) }
      else
        "#{name}#{object_extx}"
      end
    end
  end
end
